
* Scrip.py

#+begin_src python :results output
  ## General libraries
  import numpy as np
  import pandas as pd
  from matplotlib import pyplot as plt
  import seaborn as sns

  plt.rcParams['figure.figsize'] = [6, 6]

  import warnings
  warnings.filterwarnings('ignore')

  profiles = pd.read_csv('profiles.csv', encoding='utf-8')
  print(profiles.head())

  print(list(profiles.columns))

  #print("number of categories:", profiles.sign.nunique())
  #print("categories:", profiles.sign.unique())

  # Clean labels
  profiles['signsCleaned'] = profiles.sign.str.split().str.get(0)

  print("number of categories:", profiles.signsCleaned.nunique())

  print(profiles.signsCleaned.value_counts())

  #age
  #sns.displot(data=profiles, x="age", kind="hist", binwidth =5)

  # break down of gender by age
  #sns.displot(data=profiles, x="age", hue="sex", kind="hist", binwidth=5)

  #height
  #sns.displot(data=profiles, x="height", kind="hist", binwidth=2)

  # break down of gender by height
  #sns.displot(data=profiles, x="height", hue="sex", kind="hist", binwidth=2, multiple="stack")

  # income
  #sns.displot(data=profiles, x="income", hue="sex", kind="hist", binwidth=50000, multiple="stack")

  ## Categorical
  # Sex
  #sns.countplot(data=profiles, y="sex")

  # Body type
  #sns.countplot(data=profiles, y="body_type")

  # Body type broke by sex
  #sns.countplot(data=profiles, y="body_type", hue="sex")

  #Diet
  #sns.countplot(data=profiles, y="diet")

  #Drinks
  #sns.countplot(data=profiles, y="drinks")

  #Drugs
  #sns.countplot(data=profiles, y="drugs")

  #Education
  plt.figure(figsize=(6, 7))

  #sns.countplot(data=profiles, y="education")

  #Jobs
  #sns.countplot(data=profiles, y="job")

  #Offspring
  #sns.countplot(data=profiles, y="offspring")

  #Orientation
  #sns.countplot(data=profiles, y="orientation")

  #Orientation by gender
  #sns.countplot(data=profiles, y="orientation", hue="sex")

  #Pets
  #sns.countplot(data=profiles, y="pets")

  #Religion
  # set figure size
  plt.figure(figsize=(6, 7))
  #sns.countplot(data=profiles, y="religion")

  #Religion distilled down to 9 groups
  profiles['religionCleaned'] = profiles.religion.str.split().str.get(0)
  #sns.countplot(data=profiles, y="religionCleaned")

  #Signs
  #sns.countplot(data=profiles, y="signsCleaned")

  #Smoking
  #sns.countplot(data=profiles, y="smokes")

  #Status
  #sns.countplot(data=profiles, y="status")

  #print(profiles.isnull().sum())

  cols = ['body_type', 'diet', 'orientation', 'pets', 'religionCleaned', 'sex', 'job', 'signsCleaned']
  df = profiles[cols].dropna()
  print(df.shape)

  for col in cols[:-1]:
      df = pd.get_dummies(df, columns=[col], prefix=[col])

  print(df.head())

  # Check for imbalance
  print(df.signsCleaned.value_counts())

  ## Splitting the Data
  col_length = len(df.columns)

  #Y is the target column, X has the rest
  X = df.iloc[:, 1:col_length]
  Y = df.iloc[:, 0:1]

  #Validation chunk size
  val_size = 0.25

  #Split the data into chunks
  from sklearn.model_selection import train_test_split
  X_train, X_val, Y_train, Y_val = train_test_split(X, Y, test_size=val_size, random_state=0)

  #turn in to 1d arrays
  Y_train = Y_train.to_numpy().ravel()
  Y_val = Y_val.to_numpy().ravel()

  ## Prediction

  #Logistic Regression
  from sklearn.linear_model import LogisticRegression
  from sklearn.tree import DecisionTreeClassifier
  from sklearn.neighbors import KNeighborsClassifier

  lr_model = LogisticRegression(multi_class="multinomial").fit(X_train, Y_train)
  lr_predictions = lr_model.predict(X_train)

  from sklearn.metrics import classification_report
  print(classification_report(Y_train, lr_predictions))

  #KNearest Neighbor
  knn_model = KNeighborsClassifier(n_neighbors=5).fit(X_train, Y_train)
  knn_predictions = knn_model.predict(X_train)

  print(classification_report(Y_train, knn_predictions))

  #Decision Trees
  cart_model = DecisionTreeClassifier().fit(X_train, Y_train)
  cart_predictions = cart_model.predict(X_train)

  print(classification_report(Y_train, cart_predictions))

  from sklearn.metrics import confusion_matrix
  cart_cm = confusion_matrix(Y_train, cart_predictions)
  cart_labels = cart_model.classes_

  plt.figure(figsize=(10,7))

  ax = plt.subplot()
  sns.heatmap(cart_cm, annot=True, ax=ax, fmt="d")

  #labels, title and ticks
  ax.set_xlabel('Predicted labels')
  ax.set_ylabel('True labels')
  ax.set_title('Confusion Matrix')
  ax.yaxis.set_tick_params(rotation=360)
  ax.xaxis.set_tick_params(rotation=90)

  ax.xaxis.set_ticklabels(cart_labels)
  ax.yaxis.set_ticklabels(cart_labels)

  print(cart_model.get_depth())

  from sklearn.model_selection import KFold
  from sklearn.model_selection import cross_val_score

  kfold = KFold(n_splits=5, shuffle=True, random_state=0)
  results = cross_val_score(cart_model, X_train, Y_train, cv=kfold, scoring='accuracy')

  print(results)
  print("Baseline: %.2f%% (%.2f%%)" % (results.mean()*100, results.std()*100))

  cart_model20 = DecisionTreeClassifier(max_depth = 20).fit(X_train, Y_train) 
  cart_predictions20 = cart_model20.predict(X_train)

  print(classification_report(Y_train, cart_predictions20))

  results20 = cross_val_score(cart_model20, X_train, Y_train, cv=kfold, scoring='accuracy')

  print(results20)
  print("Baseline: %.2f%% (%.2f%%)" % (results20.mean()*100, results.std()*100))

  ## Final model
  knn_predictionsVal = knn_model.predict(X_val)
  print(classification_report(Y_val, knn_predictionsVal))

  final_cm = confusion_matrix(Y_val, knn_predictionsVal)
  knn_labels = knn_model.classes_

  plt.figure(figsize=(10,7))

  ax= plt.subplot()
  sns.heatmap(final_cm, annot=True, ax = ax, fmt="d")

  # labels, title and ticks
  ax.set_xlabel('Predicted labels')
  ax.set_ylabel('True labels')
  ax.set_title('Confusion Matrix')
  ax.yaxis.set_tick_params(rotation=360)
  ax.xaxis.set_tick_params(rotation=90)

  ax.xaxis.set_ticklabels(knn_labels)
  ax.yaxis.set_ticklabels(knn_labels)

  plt.show()
#+end_src

#+RESULTS:
#+begin_example
   age  ...     status
0   22  ...     single
1   35  ...     single
2   38  ...  available
3   23  ...     single
4   29  ...     single

[5 rows x 31 columns]
['age', 'body_type', 'diet', 'drinks', 'drugs', 'education', 'essay0', 'essay1', 'essay2', 'essay3', 'essay4', 'essay5', 'essay6', 'essay7', 'essay8', 'essay9', 'ethnicity', 'height', 'income', 'job', 'last_online', 'location', 'offspring', 'orientation', 'pets', 'religion', 'sex', 'sign', 'smokes', 'speaks', 'status']
number of categories: 12
signsCleaned
leo            4374
gemini         4310
libra          4207
cancer         4206
virgo          4141
taurus         4140
scorpio        4134
aries          3989
pisces         3946
sagittarius    3942
aquarius       3928
capricorn      3573
Name: count, dtype: int64
(16453, 8)
  signsCleaned  body_type_a little extra  ...  job_transportation  job_unemployed
0       gemini                      True  ...                True           False
1       cancer                     False  ...               False           False
5       taurus                     False  ...               False           False
7  sagittarius                     False  ...               False           False
9       cancer                     False  ...               False           False

[5 rows x 81 columns]
signsCleaned
leo            1516
gemini         1496
cancer         1457
virgo          1451
taurus         1390
scorpio        1356
libra          1354
pisces         1334
aries          1328
sagittarius    1312
aquarius       1262
capricorn      1197
Name: count, dtype: int64
              precision    recall  f1-score   support

    aquarius       0.13      0.07      0.09       968
       aries       0.12      0.10      0.11       983
      cancer       0.13      0.24      0.17      1129
   capricorn       0.14      0.05      0.07       882
      gemini       0.12      0.15      0.13      1130
         leo       0.12      0.19      0.15      1121
       libra       0.11      0.08      0.09      1028
      pisces       0.11      0.09      0.10       997
 sagittarius       0.13      0.09      0.11       965
     scorpio       0.14      0.05      0.08      1001
      taurus       0.13      0.12      0.12      1045
       virgo       0.12      0.21      0.15      1090

    accuracy                           0.12     12339
   macro avg       0.12      0.12      0.11     12339
weighted avg       0.12      0.12      0.12     12339

              precision    recall  f1-score   support

    aquarius       0.26      0.65      0.37       968
       aries       0.27      0.50      0.35       983
      cancer       0.27      0.41      0.33      1129
   capricorn       0.34      0.32      0.33       882
      gemini       0.37      0.34      0.35      1130
         leo       0.38      0.29      0.33      1121
       libra       0.39      0.26      0.31      1028
      pisces       0.40      0.25      0.31       997
 sagittarius       0.42      0.22      0.29       965
     scorpio       0.41      0.23      0.30      1001
      taurus       0.42      0.25      0.31      1045
       virgo       0.42      0.24      0.31      1090

    accuracy                           0.33     12339
   macro avg       0.36      0.33      0.32     12339
weighted avg       0.36      0.33      0.32     12339

              precision    recall  f1-score   support

    aquarius       0.67      0.94      0.78       968
       aries       0.66      0.88      0.75       983
      cancer       0.71      0.86      0.77      1129
   capricorn       0.74      0.84      0.79       882
      gemini       0.78      0.79      0.79      1130
         leo       0.80      0.80      0.80      1121
       libra       0.79      0.76      0.78      1028
      pisces       0.82      0.74      0.78       997
 sagittarius       0.91      0.70      0.79       965
     scorpio       0.89      0.71      0.79      1001
      taurus       0.93      0.70      0.80      1045
       virgo       0.94      0.67      0.78      1090

    accuracy                           0.78     12339
   macro avg       0.80      0.78      0.78     12339
weighted avg       0.80      0.78      0.78     12339

49
[0.08265802 0.09197731 0.09359806 0.09846029 0.08390758]
Baseline: 9.01% (0.60%)
              precision    recall  f1-score   support

    aquarius       0.57      0.39      0.47       968
       aries       0.43      0.43      0.43       983
      cancer       0.37      0.50      0.43      1129
   capricorn       0.53      0.42      0.47       882
      gemini       0.40      0.44      0.42      1130
         leo       0.36      0.48      0.41      1121
       libra       0.29      0.42      0.34      1028
      pisces       0.61      0.34      0.44       997
 sagittarius       0.64      0.33      0.44       965
     scorpio       0.37      0.39      0.38      1001
      taurus       0.53      0.39      0.45      1045
       virgo       0.32      0.40      0.36      1090

    accuracy                           0.41     12339
   macro avg       0.45      0.41      0.42     12339
weighted avg       0.45      0.41      0.42     12339

[0.07698541 0.08549433 0.08792545 0.08387358 0.08958249]
Baseline: 8.48% (0.60%)
              precision    recall  f1-score   support

    aquarius       0.07      0.22      0.11       294
       aries       0.09      0.15      0.11       345
      cancer       0.08      0.13      0.10       328
   capricorn       0.09      0.08      0.09       315
      gemini       0.08      0.08      0.08       366
         leo       0.08      0.06      0.07       395
       libra       0.10      0.07      0.08       326
      pisces       0.09      0.06      0.07       337
 sagittarius       0.09      0.04      0.05       347
     scorpio       0.10      0.05      0.07       355
      taurus       0.11      0.07      0.08       345
       virgo       0.10      0.06      0.07       361

    accuracy                           0.09      4114
   macro avg       0.09      0.09      0.08      4114
weighted avg       0.09      0.09      0.08      4114

#+end_example
